[
    {
        "name": "Canberra",
        "producer": "English Electric",
        "model": "B Mk 2",
        "engine": "2 x Rolls-Royce Avon Mk.101",
        "maxSpeed": "880 km/h",
        "maxAlt": "12 192 m",
        "img": "canberra.jpg",
        "shortDesc": "Despite world-leading Brilliance in jet engines, Britain’s early jets were not all they might be. As mentioned, the Meteor didn’t have the swept-back wings fighters needed*, the Attacker was a flop, the Hunter was too late and the Swift was an utter basketcase. But there was an exception, and it came from an unlikely manufacturer. English Electric, a company that had not produced its own aircraft designs since its quant flying boats of 1920s, suddenly came from nowhere to create the best bomber in the world, the remarkable Canberra. </p><p> Designer ‘Teddy’ Petter had proposed a fast jet-powered fighter bomber to Westland in 1944, but in a move comparable to refusing to sign The Beatles, they rejected the idea – preferring to devote their efforts to the lamentable Wyvern. Petter found a more welcome reception at English Electric, who after a war of creating other companies’ aircraft realised that smaller post-war production levels would require an in-house design. ",
        "longDesc": "The English Electric Canberra first flew in 1949 and one can only imagine the Board of Westland’s feelings as they watched as the new aeroplane’s incredible talents became apparent. In 1951 it became the first jet aircraft to make a non-stop Atlantic flight, then for most of the fifties was the highest-flying aeroplane in the world rendering it invulnerable to interception. It snatched 24 point-to-point world records (including New York to London in 6 Hours 17 Mins) and three altitude records including, with a little help from a rocket motor, a climb to 70,310 ft! Everyone was impressed. Even the Americans used them, NASA still does today, which is not bad for an aircraft that had its origins in a replacement for the wartime de Havilland Mosquito! </p><p> The RAF loved them and bought a huge amount (782) and it equipped over 55 British squadrons and was in service for 55 years! Fighter-like performance (it was orginally intended as a fighter-bomber), long-range and versatility were the hallmarks of the Canberra. It had a simple strong design, its low-wing loading (around 48 lb/sq ft far lower than the B-47) and surfeit of power allowing it to operate higher than almost any other type."
    },
    {
        "name": "Hunter",
        "producer": "Hawker",
        "model": "F.1",
        "engine": "Rolls-Royce Avon Mk.113",
        "maxSpeed": "1 108 km/h",
        "maxAlt": "14 000 m",
        "img": "hunter.jpg",
        "shortDesc": "The Hunter, the first jet aircraft produced by Hawker for the Royal Air Force, entered service as an interceptor aircraft. It displayed exceptional performance right from the start, capable of effectively matching the English Electric Canberra bomber, and even set various aviation records, including absolute speed records. The Hunter was celebrated for its quick turnaround time, made possible by features like the removable gun pack and pressurized fuelling system, as well as its ease of handling in flight.</p><p> The FGA.9 was the definitive version of the Hunter, forming the basis for the majority of export variants. Despite initial political favoritism toward the Supermarine Swift by the British Government, the Hunter proved to be far more successful. Its extended service life with various operators was attributed to its low maintenance requirements and operating costs, while the Swift program was canceled in 1955.",
        "longDesc": "The Hunter went to war in the Suez Crisis of 1956 (also known as the Tripartite Aggression), when Anglo-French-Israeli forces tried to thwart Egyptian attempts to decide the use of Egyptian waterways. Hunter F.5s of No. 1 and No. 34 Squadrons based at RAF Akrotiri in Cyprus flew escort missions in support of Canberra bombers attacking Egypt. The Hunters lack of range made them ill-suited for the mission and they were accordingly reassigned to local air defence."
    },
    {
        "name": "Lincoln",
        "producer": "Avro",
        "model": "B Mk II",
        "engine": "4 х Rolls-Royce Merlin-68A",
        "maxSpeed": "513 km/h",
        "maxAlt": "9 296 m",
        "img": "lincoln.webp",
        "shortDesc": "The Lancaster IV was a powerful beefed-up Lancaster, that emerged so different from the baseline Lanc it merited a new name. It first flew in 1944 and entered service in 1945, missing the Second World War. Nearly 600 Lincolns were built to equip a total of 29 RAF squadrons, most of which were based in the UK. During the 1950s, RAF Lincolns participated in active combat missions in Kenya against Mau-Mau insurgents, where the British met demands for greater freedom with crushing violence, including torture and mass executions.</p><p> In 1952 the bomber had the advantage over the interceptor. The alarming reality of this was made clear in the massive training exercise Operation Ardent in the UK. In the exercise Avro Lincolns (as well as Boeing Washington) bombers simulated Soviet Tupolev Tu-4 bombers. Facing them, defence forces consisted of the Gloster Meteor and de Havilland Vampire day and night fighters, RCAF Canadair Sabres and USAF F-86s. The bombers did very well, all too often proving immune from interception.",
        "longDesc": "However, they were not always safe in reality. On 12 March 1953, an RAF Lincoln was shot down 20 miles (32 km) North East of Lüneburg, Germany by several Soviet MiG-15s. The Lincoln was flying to Berlin on a radar reconnaissance flight. All seven crew members were killed.</p><p> If the British actions in Malaya can be seen as akin to US actions in Vietnam on a smaller scale then the Lincoln was very much the ‘B-52’ of Malaya. ‘Operation Firedog’ began in July 1948 with the formation of an RAF Task Force at Kuala Lumpur. Muscle came in the form of Lincolns, initially from 57 Squadron. On 15 March 1950, at a time when the British position was looking perilous, eight Lincolns arrived at Tengah. Communist forces in the jungle were small and mobile, and the RAF responded with the brute force of area bombing often in support of special forces. Lincolns were responsible for the bulk of RAF offensive operations in Malaya."
    },
    {
        "name": "Meteor",
        "producer": "Gloster",
        "model": "F Mk 8 G.41K",
        "engine": "2 х Rolls-Royce Derwent 8",
        "maxSpeed": "962 km/h",
        "maxAlt": "12 500 m",
        "img": "meteor.jpg",
        "shortDesc": "Much like Britain’s railway system, the Meteor suffered from being the first: the first and only allied jet to see combat in World War II, and the first RAF jet fighter, it came so early that wasn’t able to harvest the wealth of aerodynamical research seized from the defeated Germans, notably the benefit of the swept wing. In 1947, the F-86 arrived on the scene, and the Meteor was utterly outclassed. Illustrating just how quickly the rate of aircraft development was in this time, it should be noted that in both the preceding the Meteor had absolute world speed records. Though I say the Meteor was outclassed, in a 1951 trial at “climbing, turning and zooming below 25,000ft” the Gloster Meteor F8 was found to be superior to the F-86 Sabre (and it was estimated, the MiG-15). The F8 was far more potent than earlier Meteors, a powerful and refined machine with two uprated Derwent 8s, with 3,600 lbf (16 kN) of thrust apiece, structural strengthening, more fuel, better visibility for the pilot and a Martin Baker ejection seat.",
        "longDesc": "Between 1950 and 1955, at some of the most dangerous times of the Cold War, the Meteor F8 provided the backbone of Britain’s air defence capability. RAF Meteors served in every war that Britain took part in during its service (apart from Korea) and saw a great deal of action in the 1950s. Two RAF squadrons used the Meteor in support of the Tripartite Aggression of ’56 but neither of them operated their aircraft directly over Egypt. No.39 Squadron, based on Cyprus, flew NF Mk.13s for night patrols over Cyprus to prevent any Egyptian raids, while Malta-based No.208 Squadron, used its FR Mk.9s to fly armed reconnaissance patrols over the sea towards Egypt looking for Egyptian shipping or aircraft.</p><p> With the Korea War there was a surge in British air power, with the demand for trained military pilots leaping from 300 to 3000 per annum, this was an unrealistic effort that led to the deaths of many inexperienced aircrew. There were other reasons for the high loss rate, despite jet performance the Meteor had instruments and navigational aids more appropriate for the 1930s, and its widely spaced engines caused alarmingly asymmetric power issues if one engine shut down in flight and it also suffered from heavy controls.</p><p> The Meteor was a low-risk airframe with a high-risk new concept in propulsion, and it took the Royal Air Force into the jet age. Weirdly many parts of the Meteor ended up as prop parts in the Star Wars films."
    },
    {
        "name": "Valiant",
        "producer": "Vickers",
        "model": "B.K.1",
        "engine": "4 x Rolls-Royce Avon RA28",
        "maxSpeed": "912 km/h",
        "maxAlt": "16 460 m",
        "img": "valiant.png",
        "shortDesc": "Often written off as the least advanced of the v-bombers was arguably the most significant. On 11 October 1956, a Valiant B.1 (WZ366) of No 49 Squadron test dropped an atomic bomb on Maralinga, South Australia, this was the first time the British had air-dropped an atomic device (it followed ground detonation tests). In the same month the Valiant was the first of the V-bombers to see combat, during the Suez campaign. During Operation Musketeer, Valiants operating from Malta bombed military airfields, and communication and transport hubs in Egypt. On the first night, six Valiants were sent to attack Cairo West Air Base, which was the home of Egyptian Air Force Ilyushin Il-28 ‘Beagles’ which had been bombing targets in Israel. But the Valiant mission was aborted in flight due to the potential risk to local US personnel. Six Valiants did attack Almaza Air Base, and another five bombed Kibrit Air Base and the Huckstep Barracks. US and Soviet condemnation of the agression led to a swift end to the campaign, and is widely seen as symbolic of the end of Britain’s place as major world power. The campaign damaged British relationships with the US and drove Egypt and several Middle Eastern nations to closer relationships with the Soviet Union.",
        "longDesc": "When Gary Powers’ U-2 was shot down in 1960, it was clear that flying high offered Britain’s V-bombers no protection. Instead, the RAF began training to go in under the radar.  The strain of flying in thick low-level air soon caused fatigue cracks that saw the immediate retirement of the RAF’s Vickers Valiant B1.</p><p> The irony is that Vickers had actually built an aircraft that was perfectly suited to the new tactics.  Alongside the standard Valiant, a one-off variation on a theme had been ordered.  Based on experience from WWII, the Air Staff wanted a machine that could fly ahead of the main bomber force to accurately mark targets.  The result was the Valiant B.2. Beefed up to fly fast and low, the ‘Pathfinder’ was tested at speeds of up to 640mph.  That’s comparable to the low-level performance of the USAF’s swing wing B-1B Lancer, a machine that first flew nearly thirty years later and remains in service today."
    },
    {
        "name": "Venom",
        "producer": "De Havilland",
        "model": "FB.4",
        "engine": "de Havilland Ghost-103",
        "maxSpeed": "1 027 km/h",
        "maxAlt": "12 192 m",
        "img": "venom.jpg",
        "shortDesc": "The de Havilland Vampire was an excellent first generation jet fighter, with sparkling agility, heavy firepower and astonishing high altitude performance. But its potential was held back by a thick wing that limited its speed to mach .78. The Rolls-Royce Nene which offered 5,000Ib of thrust, almost twice the thrust of Vampire available to a F.Mk 1, was fitted to Australian FB Mk 30s but despite far more power the increase in speed was incremental. The FB Mk 30s reached 570mph, only 22mph than the far weedier Ghost 3 FB Mk 9s of the RAF. If the greater power availble could be unleashed, the Vampire’s fangs could be further sharpened. What the Vampire needed was a new thin wing. The new aircraft, allocated the designation ‘FB Mk 8’, was to have the 4,850Ib Ghost 103, which though not quite as powerful as the Nene, benefited from being an in-house design better suited to the Vampire and did not require the complicated auxillary intakes of the Nene Vampires (as well the RAAF, the French adopted the Nene Vampire as the ‘Mistral’).",
        "longDesc": "A new thinner wing was made, the new engine installed, and a swept leading edge added (and the forward swept trailing edge of the Vampire) along with other minor refinements. The swept leading edge was necessary to compensate for the heavier engine moving the centre of gravity rearwards. Attractive long-range fuel tanks were added to the wingtips; The new ‘tip-tanks’ added extra endurance at the cost of little drag as well as freeing up underwing space for additional weapons or fuel tanks. It also became 50% heavier. The new machine was now so radically different a new name was in order, the Vampire FB Mk 8 became the Venom. The Venom first flew on 2 September 1949 from Hatfield (close to London) and quickly proved itself a worthy successor to the Vampire. The top speed was a world-class 640mph, the climb rate was more than double that of the Vampire F Mk 1 at a brisk 9,000 feet a minute. It entered service in 1951 by 1955 it was the mainstay of the RAF’s Ground Attack force. Whereas the Vampire was somewhat cute and baby-like appearance, the new Venom had a sleek sinister appearance. This proved appropriate as the new ground attack aircraft soon become a post-colonial thug, employed with great effectiveness in a series of deeply questionable military actions. It took part in the Malayan Emergency from the mid 1950s, where it conducted more than 300 strikes. </p><p> It also bombed Egypt as part of Operation Muskeeter during the Suez Crisis of 1956, in which one Venom was lost to groundfire. Again in 1956, RAF Venoms were deployed during the Aden Emergency, where they were used in support of counterinsurgency operations. In Oman, the first offensive action came with unguided rocket attacks by RAF Venoms. In 1957, British RAF Venoms participated heavily in the Jebel Akhdar War supporting British aims to gain access to oil wells in the interior parts of Oman, attacking mountain top villages, water channels and crops among other targets. Following the advancement of ground forces the RAF flew eight sorties, inflicting many casualties in Firq. The decisive factor was an attack by British Special Air Service (SAS), 1st Battalion of the Cameronians, a troop of the 15/19 Hussars, and a squadron of Ferret armoured cars, supported by RAF Venoms."
    }
]